---
layout: default
title: Linux Essentials (level 1) Linux-ի Հիմունքներ (փուլ 1)
---

# Linux Essentials (level 1) Linux-ի Հիմունքներ (փուլ 1)

## PRACTICE

1. `student` օգտագործողի անունից ստեղծել հետևյալ դատարկ ֆայլեր/դիրեկտորիաներ այնպես, 
դրանք **Ի ՍԿԶԲԱՆԵ** ունենան հշված թույլտվությունները
   - `~/file11`  `- rw- r-- ---`
   - `/tmp/dir11`  `d rwx r-- r--`
   - `/tmp/dir11/file12`  `- r-- r-- r--`
   - `/tmp/dir11/file13`  `- rw- rw- ---`

<br><br>

2. `student` օգտագործողի անունից ստեղծել հետևյալ ֆայլեր/դիրեկտորիաներ այնպես, 
դրանք **Ի ՎԵՐՋՈ** ունենան հշված թույլտվությունները
   - `~/file21`  `- rwx r-x r-x`
   - `/tmp/dir21`  `d rwx --x ---`
   - `/tmp/dir21/file22`  `- rwx --- ---` (պետք է պարունակի `echo Learn Linux`) 
   - `/tmp/dir21/file23`  `- rwx rwx ---` (պետք է պարունակի `echo Hello $USER`)
   
Հարցեր. 
Եթե `/tmp/dir21` դիրեկտորիան պատկանում է `student` խմբին
   - ի՞նչ հնարավորություններ ունեն այդ խմբին պատկանող օգտագործողները :
   - կարո՞ղ են `student` խմբին պատկանող օգտագործողները կատարել 
     - `/tmp/dir21/file23` ֆայլը
     - իսկ `/tmp/dir21/file22` ֆայլը

Ստուգեք 

`sudo useradd testuser1`

`sudo gpasswd -a testuser1 student`

`sudo su - testuser1`

`/tmp/dir21/file22`

`/tmp/dir21/file23`

`exit`

<br><br>

3. Նշել մեկ հրաման, որը ցույց կտա `/usr/sbin` դիրեկտորիայի ցուցակը, 
    հետևյալ պայմաններով և մանրամասնություններով՝ 
* ԲՈԼՈՐ ֆայլերը  
* ՖԱՅԼԵՐԻ ՉԱՓՍԵՐԸ  ԳԲ/ՄԲ/...-ով  
* ՎԵՐԱԴԱՍԱՎՈՐՎԱԾ ԸՍՏ ՖԱՅԼԵՐԻ ՉԱՓՍԵՐԻ 
* ՍԿԶԲԻՑ ԱՄԵՆԱՓՈՔՐԵՐԸ

<br><br>

4. Նշել հրամանների հերթականություն, որի արդյունքում `/etc/group` ֆայլի տողերի քանակը 
կգրվի `/tmp/gres` ֆայլի մեջ: Ֆայլում պետք է լինի **ՄԻԱՅՆ** տողերի քանակի թիվը:

<br><br>

5. `student` օգտագործողի անունից պատճենել `/etc/fonts` դիրեկտորիան
`student`-ի սեփական դիրեկտորիան (home directory)

<br><br>

6. Ստեղծել `~/copy` դիրեկտորիա և տեղափոխել այնտեղ 
նախորդ քայլում ստեղծված `/etc/fonts` դիրեկտորիայի պատճեն:

<br><br>

7. `student` օգտագործողը տալիս է `cp –r /etc ~` հրաման և կատարման ընթացքում էկրանի վրա 
ստանում է հաղորդագրություններ սխալների մասին: Լրացրեք հրամանը, որպեսզի  սխալների մասին 
հաղորդագրությունները, չերևան էկրանին, այլ միանգամից վերանան:

<br><br>

8. Նշել հրամանների հերթականություն, որպեսզի `/etc/services` ֆայլի վերևից 7-րդ տողը գրվի `~/gline7` ֆայլի մեջ: 
Ֆայլում պետք է լինի **ՄԻԱՅՆ** այդ տողը, առանց որևէ այլ տվյալների:

<br><br>

9. Նշել հրամանների հերթականություն, որպեսզի համակարգի 10 ամենամեց `GID` արժեքները (`/etc/group` ֆայլի 3-րդ դաշտը) 
 գրվի `/tmp/top10` ֆայլի մեջ:

